Repository: KDE/libkcddb
Catalog: po/*/kcmcddb.po
Languages: eo, he

source: Cache Locations
eo: Kaŝmemoraj Lokoj
he: מקום המטמון

source: Could not fetch mirror list.
eo: Ne povis ekpreni spegulliston.
he: לא ניתן למשוך רשימת שרתי מראה

source: Could Not Fetch
eo: Ne Povis Akiri
he: לא ניתן למשוך

source: Select mirror
eo: Elektu spegulon
he: בחירת מראה

source: Select one of these mirrors
eo: Elektu unu el ĉi tiuj speguloj
he: בחירה באחד משרתי המראה הבאים

source: CDDB Settings
eo: CDDB-agordoj
he: הגדרות CDDB

source: &Lookup
eo: &Serĉu
he: &איתור

source: Enable MusicBrainz lookup
eo: Ebligu MusicBrainz-serĉon
he: לאפשר איתור ב־MusicBrainz

source: Enable freedb lookup
eo: Ebligu freedb-serĉon
he: לאפשר איתור ב־freedb

source: Freedb Server
eo: Freedb-Servilo
he: שרת Freedb

source: Freedb server:
eo: Freedb-servilo:
he: שרת Freedb:

source: Name of CDDB server which will be used to look up CD information.
eo: Nomo de CDDB-servilo, kiu estos uzata por serĉi informojn pri KD.
he: שם שרת CDDB שישמש לאיתור מידע על התקליטור.

source: Port:
eo: Pordo:
he: פתחה:

source: Port to connect to on CDDB server.
eo: Pordo por konekti al CDDB-servilo.
he: פתחה להתחברות לשרת ה־CDDB

source: &Transport:
eo: &Transporto:
he: מ&שלוח:

source: Type of lookup which should be tried at the CDDB server.
eo: Tipo de serĉo, kiu devus esti provita ĉe la CDDB-servilo.
he: סוג החיפוש שצריך לנסות בשרת ה־CDDB

source: Show &Mirror List
eo: &Montri Spegulliston
he: הצגת &שרתי מראה

source: &Submit
eo: &Sendi
he: &שליחה

source: Email address:
eo: Retpoŝta adreso:
he: כתובת דוא״ל:

source: Submit Method
eo: Transdona Metodo
he: שיטת שליחה

source: Server:
eo: Servilo:
he: שרת:

source: CDDB is used to get information like artist, title and song-names in CD's
eo: CDDB estas uzata por akiri informojn kiel artisto, titolo kaj kantonomoj en KD-oj
he: ייעשה שימוש ב־CDDB כדי להשיג מידע כמו אומן, כותרת ושם השיר בתוך התקליטורים
